# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, HFP, [None, [8, 8], False]] # 11-P5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12-P4
  - [6, 1, HFP, [None, [8, 8], False]] # 13-P4
  - [[-1, 12], 1, SDP, [512, [20, 20]]] # 14-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15-P3
  - [4, 1, HFP, [[0.25, 0.25], [8, 8], True]] # 16-P3
  - [[-1, 15], 1, SDP, [256, [20, 20]]] # 17-P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18-P2
  - [2, 1, HFP, [[0.25, 0.25], [16, 16], True]] # 19-P2
  - [[-1, 18], 1, SDP, [128, [20, 20]]] # 20-P2

  - [11, 1, nn.Upsample, [None, 2, "nearest"]] # 21-P4
  - [-1, 1, Conv, [512, 1]] # 22-P4
  - [[-1, 14], 1, Add, []] # 23-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24-P3
  - [-1, 1, Conv, [256, 1]] # 25-P3
  - [[-1, 17], 1, Add, []] # 26-P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 27-P2
  - [-1, 1, Conv, [128, 1]] # 28-P2
  - [[-1, 20], 1, Add, []] # 29-P2

  - [11, 1, Conv, [1024, 3]] # 30-P5
  - [23, 1, Conv, [512, 3]] # 31-P4
  - [26, 1, Conv, [256, 3]] # 32-P3
  - [29, 1, Conv, [128, 3]] # 33-P2

  - [[33, 32, 31, 30], 1, Detect, [nc]] # Detect(P3, P4, P5)
